Revit 2027 API
SpecTypeId.Illuminance Property
 Illuminance, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Illuminance { get; }
Public Shared ReadOnly Property Illuminance As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Illuminance {
	ForgeTypeId^ get ();
}
static member Illuminance : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace